[
	{
		"id": "1",
		"title": "Projet 1: Créez la page d'accueil d'une agence de voyage avec HTML & CSS",
		"cover": "/assets/imagep1.webp",
		"pictures": "/assets/imagep1.webp",
		"lien": "https://github.com/Davikovich/Projet2-Booki",
		"description": "J’ai réalisé la page d’accueil d’une agence de voyage en HTML et CSS, à partir des maquettes Figma prévues pour mobile, tablette et desktop. Le principal défi était d’assurer une parfaite adaptabilité sur tous les écrans. Pour y parvenir, j’ai utilisé des media queries et des tailles en pourcentage, garantissant une mise en page fluide et responsive.",
		"technologies": [
			"HTML",
			"CSS",
			"Figma",
			"GitHub"
		]
	},

    {
		"id": "2",
		"title": "Projet 2: Créez une page web dynamique avec Javascript",
		"cover": "/assets/imagep2.webp",
		"pictures": "/assets/imagep2.webp",
		"lien": "https://github.com/Davikovich/Projet3-SophieBluel-master",
		"description":"J’ai développé une page web interactive en JavaScript pour présenter les projets d’une architecte d’intérieur. Le projet comprenait une page de connexion, des modales et la connexion à une API. Le défi principal était de gérer l’authentification et d’assurer une communication fluide avec l’API en temps réel. Pour y parvenir, j’ai utilisé des sessions sécurisées avec JWT et des requêtes asynchrones via fetch, accompagnées d’une gestion des erreurs pour améliorer l’expérience utilisateur." ,
		"technologies": [
			"HTML",
			"CSS",
            "Javascript",
			"GitHub"
		]
	},
    {
		"id": "3",
		"title": "Projet 3: Débuggez et optimisez un site de photographe",
		"cover": "/assets/imagep3.webp",
		"pictures": "/assets/imagep3.webp",
		"lien": "https://github.com/Davikovich/Nina-Carducci-Dev-master",
		"description": "J’ai travaillé sur l’optimisation SEO et performance d’un site en utilisant Lighthouse et Wave pour détecter les problèmes. J’ai amélioré la vitesse de chargement et la structure du code, ce qui m’a permis de renforcer mes compétences en référencement et en optimisation web. Le défi principal concernait un carrousel défaillant en jQuery, une librairie que je ne maîtrisais pas. Grâce aux DevTools, j’ai identifié que l’erreur venait de la gestion des index, ce qui m’a permis de corriger le carrousel et d’améliorer la fluidité du site.",
		"technologies": [
			"Lightouse",
			"Wave",
			"GitHub"
		]
	},
    {
		"id": "4",
		"title": "Projet 4: Créez une application web de location immobiliére avec React",
		"cover": "/assets/imagep4.webp",
		"pictures": "/assets/imagep4.webp",
		"lien": "https://github.com/Davikovich/Kasa_FRv2",
		"description": "J’ai développé le front-end d’une application avec React et React Router afin d’offrir une navigation fluide et une expérience utilisateur moderne. L’enjeu principal était de gérer les états sans dupliquer les données. Pour y parvenir, j’ai utilisé les composants et les hooks de React, ce qui a simplifié la gestion et amélioré la cohérence des données.",
		"technologies": [
			"React",
			"React-Router",
			"JSX",
            "SASS",
			"GitHub"
		]
	},
    {
		"id": "5",
		"title": "Projet 5: Développez le back-end d'un site de notation de livres avec Express et NodeJs",
		"cover": "/assets/imagep5.webp",
		"pictures": "/assets/imagep5.webp",
		"lien": "https://github.com/Davikovich/MonVieuxGrimmoire-FullStack",
		"description": "J’ai développé le back-end d’une application avec Express et MongoDB, incluant des opérations CRUD pour gérer les livres et les notations, ainsi qu’un système d’authentification sécurisé.",
		"technologies": [
			"Express",
			"NodeJs",
			"MongoDB",
			"API RESTful",
			"JWT (Json Web Token)",
			"GitHub"
		]
	},
    {
		"id": "6",
		"title": "Projet 6: Planifiez le développement du site de votre client",
		"cover": "/assets/imagep6.webp",
		"pictures":  "/assets/imagep6.webp",
		"lien": "https://github.com/Davikovich/Webgencia",
		"description":"J’ai planifié le développement d’un site web à partir d’une maquette en appliquant la méthode Agile Scrum. J’ai organisé le projet avec un tableau Kanban pour suivre l’avancement et rédigé des spécifications techniques afin de clarifier les besoins. Le principal défi a été de découper les user stories en tâches concrètes. Je l’ai surmonté en les décomposant en sous-tâches claires et réalisables, ce qui a permis une progression fluide tout au long du projet.",
		"technologies": [
			"Kanban",
			"Méthodologie Agile/scrum",
			"Systeme de Veille"
		]
	}
    
]